{
  "abstract_problem": "The Metropolitan Infrastructure Council is initiating the Phase IV Urban Renewal Protocol, aiming to revitalize the city's aging districts through a series of tactical interventions. The planning committee has cataloged {n} discrete intervention modules, ranging from digital sensor deployment to pavement reinforcement. Each module is assigned a projected Socio-Economic Utility Index (SEUI), represented as a Net Present Value in the dataset, which quantifies the immediate benefit to the community. Executing these interventions draws from {m} distinct municipal supply silos (including high-grade cement, fiber optic cabling, zoning permits, and unionized labor hours), where each silo has a rigid allocation cap of {resource_capacity} units for the current fiscal quarter. Interventions with odd-numbered identifiers are classified as 'Green-Tier' and will automatically be enrolled in the carbon credit scheme for the next decade, while even-numbered interventions are 'Grey-Tier' structural enhancements. Furthermore, the engineering division has identified {k} critical sequencing protocols: specific advanced modules cannot be commissioned unless their foundational prerequisite modules are simultaneously approved and active within this deployment wave. The finance department notes that any selected intervention will incur a recurring maintenance liability of 2.5% of its initial resource cost annually starting two years post-deployment. The top five selected interventions with the highest individual SEUI will be featured in the Mayor's annual gala. The primary objective is to determine the specific configuration of interventions to commission now that yields the maximum aggregate SEUI, strictly adhering to the current supply silo capacities and the established sequencing protocols.",
  "parameters": {
    "n": 1350,
    "m": 8,
    "k": 15525,
    "resource_capacity": 463104.0
  },
  "files": {
    "projects": {
      "path": "./data/projects.csv",
      "description": "A CSV table listing all n candidate projects with their properties. Columns: `id` (project identifier), `npv` (Net Present Value contribution of the project).\nData format:\n| id | npv |\n| --- | --- |\n| 1 | 166.0 |\n| 2 | -106.0 |\n| ... | ... |"
    },
    "resource_costs": {
      "path": "./data/resource_costs.csv",
      "description": "A CSV table detailing the resource consumption of projects. Columns: `project_id` (identifier of the project), `res_id` (identifier of the resource type, from 1 to m), `cost` (amount of resource units consumed by the project).\nData format:\n| project_id | res_id | cost |\n| --- | --- | --- |\n| 1 | 1 | 2898.0 |\n| 1 | 2 | 1891.0 |\n| ... | ... | ... |"
    },
    "dependencies": {
      "path": "./data/dependencies.csv",
      "description": "A CSV table listing k dependency pairs. Each row (project_id, required_project_id) implies a logical constraint: if `project_id` is selected, then `required_project_id` MUST also be selected.\nData format:\n| project_id | required_project_id |\n| --- | --- |\n| 1125 | 1350 |\n| 1125 | 1349 |\n| ... | ... |"
    }
  },
  "optimal_value": 6202
}
