{
  "abstract_problem": "The Neo-Veridia Metropolitan Governance Board is operationalizing its decadal 'Smart Horizon' framework to overhaul municipal infrastructure. The steering committee has cataloged {n} discrete modernization initiatives, ranging from automated waste management systems to grid-scale energy storage arrays. Each initiative acts as a fundamental unit of urban transformation and carries a calculated Net Socio-Economic Yield (NPV) derived from a complex 30-year projection model adjusted for anticipated inflation and demographic shifts detailed in the project files. The implementation necessitates the allocation of {m} distinct administrative and physical capital streams, which include zoned land hectares, fiber-optic bandwidth, specialized contractor man-hours, and environmental compliance tokens. To ensure equitable distribution across departmental silos, the governance charter mandates that the aggregate consumption of any single resource category across the entire selected portfolio cannot exceed a statutory ceiling of {resource_capacity} units during the fiscal mobilization phase. Furthermore, the initiatives are tagged with metadata indicating 'Greenfield' or 'Brownfield' status, with Greenfield projects receiving priority in quarterly stakeholder newsletters. The technical architecture implies a rigid structure of operational prerequisites: there are {k} binding integration protocols where specific downstream initiatives are technically non-viable unless their upstream infrastructure foundations are simultaneously commissioned. Additionally, initiatives with a pre-calculated yield below zero represent mandatory regulatory upgrades, the operational maintenance costs of which are amortized over the first five years at a 3.5% discount rate separate from the initial yield calculation. The objective is to determine the specific configuration of initiatives to sanction for immediate execution that results in the highest possible cumulative Net Socio-Economic Yield while adhering strictly to the defined resource caps and integration protocols.",
  "parameters": {
    "n": 2023,
    "m": 8,
    "k": 31790,
    "resource_capacity": 735392.0
  },
  "files": {
    "projects": {
      "path": "./data/projects.csv",
      "description": "A CSV table listing all {n} candidate projects with their properties. Columns: `id` (project identifier), `npv` (Net Present Value contribution of the project).\nData format:\n| id | npv |\n| --- | --- |\n| 1 | 182.0 |\n| 2 | -210.0 |\n| ... | ... |"
    },
    "resource_costs": {
      "path": "./data/resource_costs.csv",
      "description": "A CSV table detailing the resource consumption of projects. Columns: `project_id` (identifier of the project), `res_id` (identifier of the resource type, from 1 to {m}), `cost` (amount of resource units consumed by the project).\nData format:\n| project_id | res_id | cost |\n| --- | --- | --- |\n| 1 | 1 | 1835.0 |\n| 10 | 1 | 2159.0 |\n| ... | ... | ... |"
    },
    "dependencies": {
      "path": "./data/dependencies.csv",
      "description": "A CSV table listing {k} dependency pairs. Each row (project_id, required_project_id) implies a logical constraint: if `project_id` is selected, then `required_project_id` MUST also be selected.\nData format:\n| project_id | required_project_id |\n| --- | --- |\n| 1734 | 2023 |\n| 1734 | 2022 |\n| ... | ... |"
    }
  },
  "optimal_value": 11242
}
